In [4]:
import pandas as pd
data = pd.Series([0.25, 0.5,0.75, 1.0], index = ['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [6]:
'b' in data ###data baigaa esehig shalgana
data[2]

0.75

In [53]:
print(list(data.items()))
list(data.items())[2] ###ted dehiig ni avyaaa
data.items() #iim ymnud bnaa gj harulna

[('area', California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64), ('pop', California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64), ('density', California     90.000000
Texas          38.018740
New York      139.076746
Florida       114.806121
Illinois       85.883763
Name: density, dtype: float64)]

array([[4.23967000e+05, 3.83325210e+07, 9.00000000e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [11]:
print(data.keys()) ###zovhon key-g avah
data.keys()[2]

Index(['a', 'b', 'c', 'd'], dtype='object')

'c'

In [10]:
data.keys

<bound method Series.keys of a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64>

In [12]:
### ogogfol nemeh
data['e'] = 1.25
data['i'] = 1.5
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
i    1.50
dtype: float64

In [13]:
##daraah baidlaar heseg ogogdliig avch bolno
data['a':'c']
data[0:3]

a    0.25
b    0.50
c    0.75
dtype: float64

In [15]:
data[(data >0.3) & (data < 1.25)] ###iim bdlar slice hiij bolno

b    0.50
c    0.75
d    1.00
dtype: float64

In [16]:
###fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [18]:
data1 = pd.Series(['a', 'b','c'], index = [1,3,5])
data1

1    a
3    b
5    c
dtype: object

In [19]:
data1.loc[1] #loc iin huvid yg utgaar ni avna same as data['c']

'a'

In [20]:
data1.iloc[1] ## iloc iin huvid indexeer ni avna data[2]

'b'

In [21]:
area_dict = {'California' : 423967,
            'Texas' : 695662,
            'New York' : 141297,
            'Florida' : 170312,
            'Illinois' : 149995}
print(area_dict)
a = pd.Series(area_dict)
a

{'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995}

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [28]:
p_dict = {'California' : 38332521,
            'Texas' : 26448193,
            'New York' : 19651127,
            'Florida' : 19552860,
            'Illinois' : 12882135}
p = pd.Series(p_dict)
p

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [29]:
data = pd.DataFrame({'area':a, 'pop':p})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [31]:
data['area']
data.area ###area baganiig avahin tuld

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [32]:
data.area is data['area']

True

In [33]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [34]:
## data framees songj avah
data.index[0]

'California'

In [37]:
data.columns[0]

'area'

In [41]:
data.values[0:2] ###1r moriin valueg array bolgj ogn

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01]])

In [42]:
###mor baganiig swap hiih,
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [43]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [46]:
data.loc[data.density>100,['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [47]:
data.iloc[0,2] = 90 ### 0 -r mornii 0,1 2iig 90 bolgoy
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [50]:
data[data.density >100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [51]:
data.items() ###iim bagtsalsan item bnaa gej haruuln

In [55]:
data.loc[:'Texas', :'density'] ##3texas hurtl

              area       pop   density
California  423967  38332521  90.00000
Texas       695662  26448193  38.01874